Revit 2027 API
MEPNetworkSegmentData.GetUpstreamSegments Method
 Gets all upstream network segments.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<MEPNetworkSegmentId> GetUpstreamSegments()
Public Function GetUpstreamSegments As IList(Of MEPNetworkSegmentId)
public:
IList<MEPNetworkSegmentId^>^ GetUpstreamSegments()
member GetUpstreamSegments : unit -> IList<MEPNetworkSegmentId>
Return Value
IList<MEPNetworkSegmentId>
 The list of segments that flow into this segment.
See Also
Reference
MEPNetworkSegmentData Class
Autodesk.Revit.DB.Analysis Namespace